import React from "react";
import styled from "styled-components";
import xVector from "../../img/icon/xVector.svg";

const WholeWrapper = styled.div`
    width:100%;
    height:100%;
    position:relative;
`

const XWrapper = styled.button`
    all:unset;
    cursor: pointer;
    position:absolute;
    width:16px;
    height:16px;
    top:20px;
    right:20px;
    display:flex;
    align-items:center;
    text-align:center;

    img{
        margin:0 auto;
        width:100%;
        height:100%;
    }
`;

const Title = styled.div`
    position:absolute;
    width: calc(100% - 32px);
    height:28px;
    top:16px;
    margin-left:16px;
    display:flex;
    align-items:center;

    h1{
        color:#101010;
        font-size: 1.125rem;
        font-weight: 700;
        line-height: 1.75rem;
        letter-spacing: -0.015rem;
    }
`;

const Description = styled.div`
    position:absolute;
    width:calc(100% - 32px);
    height:calc(100vh - 136px);
    margin-left:16px;
    top:76px;
    overflow:auto;
    text-align:left;
  
    p{
      color:#333333;
      font-size: 0.75rem;
      line-height: 1.3125rem;
      letter-spacing: -0.015rem;
    }
`

const GivGuideModal = ({closeModal}) => {
   
    return(
        <WholeWrapper>
            <Title>
                <h1>
                    기브 이용약관                    
                </h1>
            </Title>
            <XWrapper onClick={closeModal}>
                <img src={xVector} alt="나가기버튼" />
            </XWrapper>
            <Description>
                <p>
                                    제1조 (목적, 적용범위 등)<br/>
                    ① 이 약관은 퍼네이션(이하 “회사”)의 서비스에서 컨텐츠를 이용하기 위해 사용되는 전용상품권과 관련하여 회사와 이용자(이하 “이용자”) 사이의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.<br/>

                    ② 이 약관에서 정하지 않은 부분은 기부니가좋다 서비스 이용약관(이하 "기부니가좋다 이용약관")에서 정한 바에 따릅니다.<br/>

                    제2조 (정의)<br/>
                    ① 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.<br/>

                    1. “전용상품권”은 기부니가좋다 서비스에서 컨텐츠를 구매 또는 대여하기 위해 사용할 수 있는 회사가 발행한 전자적 증표 또는 그 증표에 관한 정보로서, 전자적 지급수단을 말하며 명칭은 회사의 결정에 따라 변경될 수 있습니다. 회사는 컨텐츠의 종류별로 별도의 전용상품권을 발행할 수 있으며 개별 전용상품권에 대한 정책에 따라 이를 운영합니다.<br/>

                    ② 이 약관에 정의되지 않은 용어는 기부니가좋다 이용약관의 정의에 따릅니다.<br/>

                    제3조 (전용상품권의 구매 등)<br/>
                    ① 회사는 이용자의 전용상품권 구매 전에 전용상품권에 대한 거래 조건을 정확하게 이해하고 실수나 착오 없이 거래할 수 있도록 다음 각 호의 사항들을 적절한 방법으로 이 약관 및 서비스 내에서 고지합니다.<br/>

                    1. 판매자의 상호, 대표자 성명, 주소, 전화번호 등<br/>
                    2. 전용상품권의 확인 및 선택, 구매 방법의 선택 및 결제정보의 입력, 구매 신청에 관한 확인, 종류 및 가격, 이용방법, 이용시기, 이용조건 등 구체적 내용<br/>
                    3. 청약철회 및 계약해제의 기한・행사방법 및 효과, 환불 등에 관한 사항<br/>
                    4. 소비자의 피해보상, 불만 처리 및 분쟁 처리에 관한 사항<br/>

                    ② 회사는 이용자의 전용상품권 구매 신청이 다음 각 호에 해당하는 경우에는 승낙하지 않거나 승낙을 유보하거나, 추후 승낙을 취소할 수 있습니다.<br/>

                    1. 실명이 아니거나 타인의 명의를 이용한 경우<br/>
                    2. 허위의 정보를 기재하거나, 필수 사항을 기재하지 않은 경우<br/>
                    3. 서비스 관련 설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우<br/>
                    4. 동일 아이피의 대량 결제, 유사 아이디에서의 연속적인 결제, 위험 아이피에서의 결제 등 도용에 의한 전용상품권의 구매로 판단되는 경우<br/>
                    5. 만 19세 미만의 미성년자가 법정대리인의 동의 없이 신청한 경우<br/>
                    6. 결제에 대한 지급이 실제로 이루어지지 않았거나 않을 가능성이 있는 경우<br/>
                    7. 기타 이용자의 전용상품권의 구매 신청이 회사와 제3자의 이익을 훼손할 위험이 있다고 판단되는 경우<br/>

                    ③ 전용상품권의 구매 계약은 회사가 구매 완료를 신청절차 상에서 표시 또는 이용자에게 고지한 시점에 성립되며, 이때 회사는 제1항 각 호의 내용을 포함하여 계약체결의 내용을 즉시 이용자에게 교부합니다.<br/>

                    ④ 이용자는 이 약관 동의 및 전용상품권 구매에 따른 결제 후 서비스에서 전용상품권을 이용할 수 있습니다. 단, 구매를 전제하지 않는 무상 전용상품권 및 무상 작품별이용권의 경우에는 이 약관에 동의 후 이용할 수 있습니다.<br/>

                    ⑤ 전용상품권은 유상 전용상품권, 무상 전용상품권으로 구별되고, 무상 전용상품권은 사용 컨텐츠의 제한이 있는 것과 사용 컨텐츠의 제한이 없는 것 및 유상 전용상품권 구매 시 추가로 지급되는 무상 전용상품권(이하 “추가 무상 전용상품권”)으로 구별되며, 여러 종류의 상품권을 보유하고 있는 경우 다음과 같은 순서로 사용됩니다. 한편, 동일한 종류의 전용상품권이 다수 존재할 때에는 유효 기간이 짧은 순서로 사용됩니다.<br/>

                    1. 사용 컨텐츠의 제한이 있는 무상 전용상품권<br/>
                    2. 사용 컨텐츠의 제한이 없는 무상 전용상품권<br/>
                    3. 추가 무상 전용상품권<br/>
                    4. 유상 전용상품권<br/>

                    ⑥ 회사는 이용자에게 사전에 공지하고 전용상품권 등의 종류와 가격, 지급수량 등 그 구체적인 내용을 변경하거나 특정한 전용상품권을 폐지할 수 있습니다. 단, 그와 같은 변경 및 폐지가 이용자에게 불리한 경우에는 공지 외 네이버 서비스 내 전자우편, 전자쪽지, 로그인시 동의창 등의 전자적 수단을 통해 개별적으로 통지하여야 합니다.<br/>

                    ⑦ 회사가 전용상품권의 종류 및 내용 등을 변경 혹은 폐지함에 따라 이용자가 자신의 귀책 없이 기존에 구매한 전용상품권 등을 구매할 당시에 정한 조건 등에 따라 이용하지 못하게 될 경우, 회사는 그와 같이 이용하지 못한 부분에 대해서 회원에게 적절한 보상을 합니다.<br/>

                    제4조 (미성년자 계약체결에 대한 특칙)<br/>
                    ① 만 19세 미만의 미성년자인 이용자는 전용상품권 구매를 위해서는 부모 등 법정대리인의 동의를 얻어야 하며, 회사가 정한 절차에 따른 법정대리인의 동의를 받지 않은 경우에는 전용상품권을 구매할 수 없습니다.<br/>

                    ② 회사는 만 19세 미만의 미성년자인 이용자가 전용상품권을 구매하고자 하는 경우 부모 등 법정대리인의 동의를 얻지 않으면 미성년자 본인 또는 법정대리인이 그 계약을 취소할 수 있다는 내용을 계약 체결 전에 고지합니다.<br/>

                    ③ 이용자가 미성년자임에도 불구하고 성년자인 제3자의 고유정보를 이용하여 구매하였거나 법정대리인의 동의절차를 진행한 경우 또는 성년자인 제3자의 결제정보를 동의 없이 이용하여 결제를 하는 등 속임수로써 회사로 하여금 이용자가 성년자이거나 이용자의 법정대리인 동의가 있었던 것으로 믿게 한 경우 및 법정대리인이 범위를 정하여 처분을 허락한 재산으로 전용상품권을 구매한 경우에는 법정대리인의 동의가 없더라도 전용상품권 구매 및 구매한 전용상품권의 사용을 이용자 또는 그 법정대리인이 일방적으로 취소할 수 없습니다.<br/>

                    제5조 (지급방법)<br/>
                    ① 이용자가 앱 내 구입(In App Purchase, 이하 “IAP”) 방법으로 전용상품권을 구매하는 경우에는 해당 앱마켓이 요구하는 절차를 이행하여야 합니다. IAP를 통한 전용상품권 구매 시 최종 결제 금액은 앱마켓 내 결제창에서 확인하실 수 있으며, 앱마켓의 정책 및 기준에 따라 이용자의 월별 누적 결제액 및 전용상품권 구매한도가 제한될 수 있습니다. 해당 기준을 초과한 경우 IAP로 판매되는 전용상품권의 추가 이용은 불가능할 수 있습니다.<br/>

                    ② 이외에 전용상품권의 결제에 대하여는 기부니가좋다 이용약관의 유료서비스에 대한 내용이 적용됩니다.<br/>

                    제6조 (청약철회등)<br/>
                    ① 이용자는 전자상거래 등에서의 소비자 보호에 관한 법률 등 관련 법령에서 정한 바에 따라 유상으로 구매한 전용상품권에 대하여 계약체결에 대한 내용을 교부 받은 시점 혹은 구매한 전용상품권을 제공받은 시점으로부터 7일 이내에 청약의 철회 및 계약의 해제(이하 “청약철회등”)를 할 수 있습니다. 단, 이용자가 구매한 전용상품권을 이미 사용한 경우에는 사용한 부분에 대해서는 청약철회등이 불가능하며, 이러한 불가능 사유에 대해서는 전용상품권 구매 시 회사가 이용자에게 명확하게 고지합니다.<br/>

                    ② 전항에도 불구하고 전용상품권의 내용이 표시・광고의 내용과 다르거나 계약내용과 다르게 이행된 경우에는 이용자는 그 전용상품권을 공급받은 날부터 3개월 이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내에 청약철회등을 할 수 있습니다.<br/>

                    ③ 제1항 또는 제2항에 따라서 이용자가 청약철회등을 한 경우 전자상거래 등에서의 소비자 보호에 관한 법률에 따라 이용자가 구매한 전용상품권은 반환되며, 회사는 동법에 따라 환급 절차를 진행합니다.<br/>

                    ④ 그 밖에 본 조에 따른 청약철회등에 대한 사항은 전자상거래 등에서의 소비자 보호에 관한 법률에 따라 규율 및 처리됩니다.<br/>

                    ⑤ 제1항부터 제4항에도 불구하고 IAP의 경우, 회사는 해당 앱마켓에 대하여 대금지급의 정지∙취소 요청 등 전자상거래 등에서의 소비자 보호에 관한 법률에 따른 관련 조치를 요청합니다. 다만, 해당 앱마켓의 위와 같은 회사의 요청에 따른 조치에 대하여는 해당 앱마켓의 정책을 참조하여 주시기 바랍니다.<br/>

                    제7조 (환불정책)<br/>
                    ① 회사는 이용자가 구매한 전용상품권의 미사용분에 대해 환불을 요구할 경우 환불수수료에 해당하는 금액을 공제하고 환불할 수 있습니다. 단, 회사의 귀책으로 인한 경우에는 환불수수료를 공제하지 않습니다. 이용자가 전용상품권의 구매 시 함께 지급된 추가 무상전용상품권을 사용한 경우에는 유상 전용상품권의 미사용분에서 해당 분량을 제외하고 환불됩니다.<br/>

                    ② 무상 전용상품권은 전항의 환불 대상에서 제외됩니다.<br/>

                    ③ 회사는 이용자에 대하여 환불을 신청한 날부터 3영업일 이내에 그 결제와 동일한 방법으로 이를 환불합니다.<br/>

                    ④ 제1항 및 제3항에도 불구하고 IAP의 경우, 회사는 해당 앱마켓에 대하여 대금지급의 정지∙취소 요청 등 전자상거래 등에서의 소비자 보호에 관한 법률에 따른 관련 조치를 요청합니다. 다만, 해당 앱마켓의 위와 같은 회사의 요청에 따른 조치에 대하여는 해당 앱마켓의 정책을 참조하여 주시기 바랍니다.<br/>

                    제8조 (유효기간 등)<br/>
                    ① 유상 전용상품권의 유효기간은 마지막 충전일 또는 사용일부터 10년입니다. 다만, 무상 전용상품권의 경우 제공 시 이용자에게 안내한 이용조건에 따라 유효기간이 정해질 수 있습니다.<br/>

                    제9조 (기타)<br/>
                    ① 회사는 공정거래위원회에서 제정한 신유형 상품권 표준약관 제4조의 표시사항을 서비스 페이지, 고객센터 등에 표시합니다.<br/>

                    ② 회사는 이용자를 보호하기 위하여 회사가 발행한 유상의 전용상품권 발행잔액에 대해 전자상거래 등에서의 소비자 보호에 관한 법률에서 정한 보증계약을 체결합니다.<br/>

                    ③ 회사는 소비자의 피해보상, 불만 처리 및 분쟁 처리에 관한 사항, 환불에 대한 사항 등 소비자의 문제 제기에 대해 해결하기 위해서 고객센터를 운영합니다.<br/>

                    ④ 본 약관의 다른 내용에도 불구하고, 회사가 제공하는 서비스 중 iOS앱을 통해 제공되는 일부 서비스는 iOS앱에서만 구매 및 사용할 수 있는 전용상품권(이하 “iOS앱 전용상품권”)을 통해 이용하실 수 있습니다. 그 외 iOS앱 전용상품권의 구매 및 사용에 대하여는 본 약관의 내용이 준용됩니다.<br/>
                    <br/>   
                    [부칙]<br/>
                    이 약관은 2021년 2월 1일부터 적용됩니다.
                </p>
            </Description>
        </WholeWrapper>
    );
};

export default GivGuideModal;